{
  "what are ayushman's skills?": "Based on the information provided, Ayushman Anupam possesses a comprehensive and diverse skill set spanning data science, artificial intelligence, finance, and software development. His skills can be summarized as follows:\n\n### Technical Skills\n\n*   **Programming & Databases**\n    *   **Languages:** Python, R, SQL, LaTeX\n    *   **Web & Deployment:** Streamlit, RShiny, Flask, HTML, CSS, Google Cloud\n    *   **Databases:** Relational Database Management Systems (RDBMS), Vector-stores, Advanced Databases\n\n*   **AI, Machine Learning & Deep Learning**\n    *   **Concepts:** Supervised & Unsupervised Learning (Regression, Classification, Clustering), Recommender Systems, Reinforcement Learning, Time-Series Forecasting.\n    *   **Deep Learning & NLP:** Artificial Neural Networks (ANN), CNNs, RNNs/LSTMs, GANs, GNNs, Autoencoders, Transformers, and Natural Language Processing (NLP).\n    *   **Agentic AI & LLMs:** AI Agents, LangGraph, Retrieval-Augmented Generation (RAG), Multi-Agent Systems, and Large Language Models (LLMs) via Groq API.\n    *   **Frameworks:** PyTorch, TensorFlow.\n\n*   **Data Analysis & Visualization**\n    *   **Libraries:** Pandas, NumPy, Scikit-learn, Matplotlib, Seaborn, Plotly, Folium.\n    *   **Techniques:** Data Manipulation, Cleaning, Exploratory Data Analysis (EDA), Feature Engineering, Statistical Analysis, Hypothesis Testing, and Predictive Modeling.\n    *   **Model Evaluation:** Hyperparameter Tuning, Model Optimization, and performance metrics (Accuracy, Precision, Recall, F1-score, ROC-AUC, RMSE, MAE).\n\n*   **Tools & Platforms**\n    *   **Development:** Git, Jupyter Notebook.\n    *   **Business Intelligence & Office:** Tableau, MS Office Suite (Word, Excel, PowerPoint), Power Platform (Power BI, Power Apps, Power Automate), and Microsoft 365 Copilot.\n\n### Core Competencies & Domain Knowledge\n\n*   **Computer Science Fundamentals:** Data Structures, Algorithms, Object-Oriented Programming (OOP), Problem Solving, and Graph Traversal.\n*   **Finance & Risk Management:** Portfolio Management, Risk Assessment (Credit, Market, Operational), Financial Statement Analysis, Equity Selection, and strategic frameworks like Game Theory.\n*   **Professional Skills:** Data Visualization, Dashboard Creation, Business Analytics, Communication, and Corporate Ethics.\n\nWould you like to know anything else related to this question or any other aspect of Ayushman Anupam's resume or portfolio?",
  "tell me about ayushman?": "Of course. Here is a consolidated and polished summary of Ayushman Anupam's profile.\n\nAyushman Anupam is a Data Science student with a strong foundation in Mathematics, passionate about leveraging data, statistics, and AI to solve real-world problems. His primary interests include Machine Learning, Graph Theory, Statistical Modeling, and especially Agentic AI, where he focuses on building intelligent systems to derive actionable insights from data.\n\n### Professional Profile\n\n*   **Current Role:** He is an AI Agent Development Intern at Algo Labs, where he builds AI agents using technologies like LangGraph and Retrieval-Augmented Generation (RAG) to improve educational content delivery.\n*   **Education:**\n    *   **M.Sc in Data Science** from Chennai Mathematical Institute (2024 - Present), with a CGPA of 8.62.\n    *   **B.Maths (Hons.)** from the Indian Statistical Institute (2020 - 2024), with a final percentage of 63%.\n*   **Key Achievements:**\n    *   Achieved an All India Rank of **271** in GATE 2024 (Statistics).\n    *   Secured Rank **1** in the Indian Statistical Institute (ISI) MS QMS 2024 Entrance Exam.\n\n### Key Skills\n\n*   **AI and Machine Learning:** Transformers, Large Language Models (LLM), AI Agents, LangGraph, RAG, Supervised & Unsupervised Learning, Reinforcement Learning, Recommendation Systems, and Deep Learning (ANN, CNN, GANs).\n*   **Programming and Tools:** Python (Pandas, NumPy, Scikit-learn, PyTorch, TensorFlow), R, SQL, Jupyter Notebook, Git, PowerBI, Tableau, and Streamlit.\n*   **Core Competencies:** Data Analysis, Predictive Modeling, Feature Engineering, Statistical Analysis, and Data Visualization.\n\n### Project Experience\n\nAyushman has developed a diverse portfolio of projects that showcase his ability to build end-to-end solutions, from statistical analysis to interactive AI applications.\n\n*   **AI Applications & Web Development:**\n    *   **Streamlit Portfolio with Agentic AI:** Developed his personal portfolio website using Streamlit, featuring an integrated AI assistant (ResAgent) built with LangGraph and the Groq LLM.\n    *   **Heartbeat Sentinel:** A Streamlit web app that predicts heart failure risk with 90% accuracy using Random Forest and XGBoost models.\n    *   **From Data to Dwellings:** An interactive RShiny application for visualizing and analyzing Amsterdam housing price data.\n\n*   **Predictive Modeling & Machine Learning:**\n    *   **CreditRisk:** Developed classification models to predict loan default risk, achieving 97% accuracy.\n    *   **ChurnPredict:** Built models using Logistic Regression, Random Forest, and XGBoost to predict customer churn.\n    *   **Chennai Weather Forecasting:** Implemented a time-series model to forecast daily temperature and precipitation.\n\n*   **Customer Analytics & Recommender Systems:**\n    *   **NextBuy:** Created a hybrid e-commerce product recommendation system combining Content-Based and Collaborative Filtering methods.\n    *   **ClusterCart:** Segmented customers using K-Means clustering and PCA to enable targeted marketing strategies.\n\n*   **Theoretical & Statistical Research:**\n    *   **Spectral Graph Partitioning:** Implemented a solution for optimal graph partitioning based on Fiedler's theory and the properties of the Laplacian matrix.\n    *   **Analysis of WASH Inequality:** Conducted a statistical analysis of Water, Sanitation, and Hygiene (WASH) service inequality in major Indian cities under the mentorship of Prof. Rituparna Sen at the Indian Statistical Institute.\n\n### Certifications & Continuous Learning\n\nAyushman is committed to continuous learning, demonstrated by numerous certifications from recognized institutions.\n\n*   **AI and Machine Learning:** He has completed advanced specializations in PyTorch, TensorFlow (from DeepLearning.AI), Reinforcement Learning (from the University of Alberta), and Machine Learning (from Stanford University).\n*   **Finance and Risk Management:** He holds certifications in Risk Management from the New York Institute of Finance and a preparatory certificate in Finance and Financial Markets from the Corporate Finance Institute.\n*   **Technical and Professional Skills:** He has completed comprehensive bootcamps in Data Structures & Algorithms and SQL, and is certified in the Microsoft Office 365 and Power Platform. He has also developed his soft skills through the TCS iON Young Professional Course.\n\n### Portfolio & Professional Links\n\n*   **Portfolio Website:** [https://ayushmanportfolio.streamlit.app/](https://ayushmanportfolio.streamlit.app/)\n*   **LinkedIn:** [https://www.linkedin.com/in/ayushman-anupam/](https://www.linkedin.com/in/ayushman-anupam/)\n*   **GitHub:** [https://github.com/AyushmanGHub](https://github.com/AyushmanGHub)\n\n***\n\nWould you like to know more about his specific projects, skills, or any other aspect of his profile?",
  "what are ayushman's technical skills?": "Based on his resume, Ayushman Anupam has a diverse technical skill set focused on data science, AI, and machine learning. His expertise covers advanced AI concepts, a range of programming languages, and various data analysis and visualization tools.\n\nHis core technical competencies include Data Analysis, Predictive Modeling, Feature Engineering, Model Evaluation & Optimization, and Statistical Analysis.\n\nHere is a detailed breakdown of his skills:\n\n*   **AI, LLMs, and Agentic AI:** He is skilled in Transformers, Large Language Models (LLMs), and Agentic AI. His experience includes working with LangGraph, Vector-stores, Retrieval-Augmented Generation (RAG), Multi-Agent Systems, and API Integrations.\n*   **Machine & Deep Learning:** Ayushman has a strong foundation in Supervised and Unsupervised Learning techniques such as Regression, Classification, and Clustering. He also has experience building Recommendation Systems (Content-Based and Collaborative Filtering) and is knowledgeable in Artificial Neural Networks (ANN) and Convolutional Neural Networks (CNN).\n*   **Programming Languages:** He is proficient in Python (including libraries like Pandas, NumPy, Scikit-learn, Matplotlib, and Plotly), R, SQL, and LaTeX.\n*   **Tools & Platforms:** His technical toolkit includes Jupyter Notebook, Git, and data visualization platforms like Tableau, Power BI, R-Shiny, and Streamlit.\n\nWould you like to know anything else related to this question or any other aspect of Ayushman Anupam's resume or portfolio?",
  "tell me about his education": "Based on the information provided, here is a summary of Ayushman Anupam's educational background.\n\nAyushman has a strong academic foundation in mathematics and data science from prestigious Indian institutions. He is currently pursuing a Master's degree and holds a Bachelor's in Mathematics.\n\n*   **M.Sc in Data Science** (2024 - Present)\n    *   **Institute**: Chennai Mathematical Institute\n    *   **CGPA**: 8.62\n    *   **Relevant Coursework**: Python, Probability and Statistics with R, Mathematical Analysis, Data Visualization, Linear Algebra, Algorithm Design and Analysis, Data Mining and Machine Learning.\n\n*   **B.Maths. (Hons.)** (2020 - 2024)\n    *   **Institute**: Indian Statistical Institute\n    *   **Percentage**: 63%\n    *   **Relevant Coursework**: Probability, Statistics, R, Graph Theory, Optimization, Economics, Linear Algebra, Design and Analysis of Algorithms, Graph and Matrices.\n\n***\n\nWould you like to explore anything else, such as his skills, projects, or another aspect of his resume?",
  "tell me about his volunteerings": "Of course. Here is a consolidated summary of Ayushman Anupam's volunteering experience.\n\nBased on his resume, Ayushman Anupam has actively volunteered with three non-governmental organizations (NGOs), focusing on community welfare, rural development, and public health. His contributions are detailed below:\n\n*   **Mali (Malakar) Kalyan Samiti** (Jamshedpur, Jharkhand | Dec 2020 - Present)\n    As an ongoing Active Member and Social Service Worker, Ayushman contributes to local community upliftment by organizing blood donation camps, managing donor coordination, and promoting environmental hygiene through cleanliness programs.\n\n*   **Gramin Muskan Seva Sansthan** (Jamshedpur, Jharkhand | May 2024 – June 2024)\n    In his role as a Volunteer Social Service Worker, he focused on rural development. His activities included conducting computer literacy sessions for students, organizing workshops to educate farmers on government schemes and modern agricultural techniques, and coordinating with officials to implement projects such as solar-powered water pumps and street lighting.\n\n*   **Voluntary Blood Donors Association** (Jharkhand | June 2023)\n    As a Volunteer, he specifically supported public health initiatives by assisting with the coordination and registration at blood donation camps. He also conducted awareness programs at educational institutes to promote the importance and sustainability of voluntary blood donation.\n\n***\n\nWould you like to know anything else about his volunteering, or perhaps another aspect of Ayushman Anupam's resume or portfolio?",
  "tellme about 'streamlit portfolio website with agentic ai assistant' project?": "Of course. Here is a consolidated overview of the \"Streamlit Portfolio Website with Agentic AI Assistant\" project.\n\nThe \"Streamlit Portfolio Website with Agentic AI Assistant\" is a project developed by Ayushman in June 2025 to create a personal portfolio that is significantly more interactive than a typical static website. The primary goal was to build a platform where visitors can actively engage with the content, ask questions, and receive live, relevant information directly.\n\nThe solution is a fully responsive website built with Streamlit, which features an integrated AI assistant named ResAgent. This assistant is the core of the project, designed to overcome the limitations of static portfolios by enabling interactive conversations and fetching real-time data for users.\n\nKey features and details of the project include:\n\n*   **Interactive AI Assistant (ResAgent):** This agent allows users to ask specific questions about Ayushman's skills, projects, and experience. It is powered by Large Language Models (LLMs) through the Groq API and uses LangGraph to manage its conversational and data-fetching abilities.\n*   **Dynamic Content:** The portfolio includes dynamically generated pages for projects, highlights of certifications, and an AI-powered blog, ensuring the content is fresh and engaging.\n*   **Technologies Used:** The project leverages a modern tech stack, including Python, Streamlit, LangGraph, Groq LLM, Agentic AI, HTML, and CSS.\n*   **Live Website:** You can interact with the project live at [https://ayushmanportfolio.streamlit.app/](https://ayushmanportfolio.streamlit.app/)\n*   **Source Code:** The code is available on GitHub at [https://github.com/AyushmanGHub/APortfolio](https://github.com/AyushmanGHub/APortfolio)\n\nWould you like to know anything else about this project or any other aspect of Ayushman Anupam's resume or portfolio?",
  "how to contact him?": "You can contact Ayushman Anupam using the following methods:\n\n*   **Email:** `ayushmantutu@gmail.com` or `ayushmana.mds2024@cmi.ac.in`\n*   **Phone:** +91 7717760813\n*   **LinkedIn:** [linkedin.com/in/ayushman-anupam](https://www.linkedin.com/in/ayushman-anupam/)\n*   **GitHub:** [github.com/AyushmanGHub](https://github.com/AyushmanGHub)\n*   **Portfolio Website:** [ayushmanportfolio.streamlit.app](https://ayushmanportfolio.streamlit.app/)\n\nHis location is Jamshedpur, Jharkhand, India.\n\nWould you like to know anything else related to this question or any other aspect of Ayushman Anupam's resume or portfolio?",
  "show me ayushman's latest projects": "Of course. Here are Ayushman's latest projects, presented in reverse chronological order.\n\n*   **Streamlit Portfolio Website with Agentic AI Assistant** (June 2025)\n    This project involved creating a dynamic personal portfolio website using Streamlit. It features an integrated AI assistant, \"ResAgent,\" built with LangGraph and the Groq LLM API, which can answer user queries and engage in interactive conversations. The site also includes dynamically generated project pages and an AI-powered blog.\n    *   **Skills/Technologies:** Python, Streamlit, LangGraph, Groq LLM, Agentic AI, HTML, CSS, Groq API.\n    *   **Links:** [GitHub](https://github.com/AyushmanGHub/APortfolio) | [Website](https://ayushmanportfolio.streamlit.app/)\n\n*   **Fiedler's Theory of Spectral Graph Partitioning** (April 2025)\n    This project addressed the challenge of partitioning a graph into balanced and well-connected subgraphs while minimizing cut edges. Ayushman implemented Fiedler's Theory, which uses the spectral properties of a graph's Laplacian matrix to find optimal partitions, demonstrating both theoretical understanding and practical application in network analysis.\n    *   **Skills/Technologies:** Python, Jupyter Notebook, LaTeX, Graph Theory, Spectral Graph Partitioning, Network Analysis.\n    *   **Links:** [GitHub](https://github.com/AyushmanGHub/Fiedlers-Spectral-Graph-Partitioning-Paper) | [Paper](https://drive.google.com/file/d/1JJtpv_99XfyESqNQr_QpuK5iCuthB9SW/edit)\n\n*   **CreditRisk - Predicting Borrower Reliability** (March 2025)\n    To help financial institutions minimize lending risks, this project focused on identifying customers likely to default on loans. Ayushman developed and implemented several binary classification models that achieved 97% accuracy. The work also included feature selection techniques to determine the most significant factors influencing prediction outcomes.\n    *   **Skills/Technologies:** Python, Machine Learning, Binary Classification, Feature Selection, Model Evaluation, Risk Assessment.\n    *   **Link:** [GitHub](https://github.com/AyushmanGHub/CreditRisk-Predicting-Borrower-Reliability)\n\nWould you like to know more about these projects or any other aspect of Ayushman Anupam's resume or portfolio?",
  "show me his work experience/internships?": "Based on the resume, here is Ayushman Anupam's work and internship experience:\n\n*   **AI Agent Development Intern** at **Algo Labs**\n    *(May 2025 - July 2025)*\n    He contributed to developing advanced AI agents for automating complex tasks. A key achievement was creating a \"Lecture Agent,\" a smart Agentic-AI framework designed to transform lecture videos into interactive learning tools, including a personalized chatbot, mind map, and notes. This project utilized LangGraph for workflow orchestration, RAG for contextual understanding, and integrated multiple APIs for data processing.\n    *   **Skills:** Agentic AI, LangGraph, RAG, Multi-Agent Systems, API Integrations, Knowledge Retrieval, Educational Technology.\n\n*   **Data Scientist Intern** at **COTHON SOLUTIONS**\n    *(December 2024)*\n    He worked on several real-world machine learning projects. His responsibilities included developing customer segmentation models with K-Means clustering for targeted marketing, building e-commerce recommendation systems using Content-Based and Collaborative Filtering, and designing predictive models for heart risk assessment. He also performed rigorous model evaluation using metrics like accuracy, precision, recall, and RMSE.\n    *   **Skills:** Python, Machine Learning, K-Means Clustering, Collaborative & Content-Based Filtering, Model Evaluation, Data Analysis.\n\n*   **Finance and Stock Market Intern (Trainee)** at **CAPITAL VISION INVESTMENT**\n    *(November 2024 - December 2024)*\n    During this traineeship, he gained experience in financial investment strategies, portfolio management, and risk assessment. He developed a strong understanding of various financial instruments, such as mutual funds, National Pension System (NPS), fixed deposits, and tax-efficient investments.\n    *   **Skills:** Portfolio Management, Risk Assessment, Equity Selection, Mutual Funds, NPS, Financial Markets, Wealth Management.\n\nWould you like to know more details about these roles or explore another section of Ayushman Anupam's resume or portfolio?",
  "tell me about his lastest work experience?": "Based on his resume, Ayushman Anupam's latest work experience is as an AI Agent Development Intern at Algo Labs from May 2025 to July 2025.\n\nDuring this internship, his work focused on creating advanced AI agents to automate complex tasks and enhance educational technology. He developed an Agentic-AI framework called the \"Lecture Agent,\" which transforms lecture videos into interactive learning experiences by providing students with a personalized chatbot, mind-map, and notes.\n\nKey technologies and skills utilized in this role include:\n*   **Agentic AI & Multi-Agent Systems:** Building intelligent agents for sophisticated automation.\n*   **LangGraph & RAG:** Using LangGraph for workflow orchestration and Retrieval-Augmented Generation (RAG) pipelines for deep contextual understanding.\n*   **API Integrations:** Integrating multiple APIs for seamless data processing.\n*   **AI-driven Content Generation:** Applying cutting-edge AI for personalized content, knowledge retrieval, and creating intelligent educational tools.\n\n***\n\nWould you like to know more about this role or any other aspect of Ayushman Anupam's resume or portfolio?",
  "list me his projects?": "Based on Ayushman Anupam's resume, here is a consolidated list of his projects:\n\n*   **Streamlit Portfolio Website with Agentic AI Assistant** (June 2025)\n    Developed a personal portfolio website using Streamlit that features an interactive, agentic AI assistant named ResAgent. The assistant uses LLMs to answer queries and fetch live information, complementing dynamically generated project pages and an AI-powered blog.\n    *   **Website:** [ayushmanportfolio.streamlit.app](https://ayushmanportfolio.streamlit.app/)\n    *   **GitHub:** [APortfolio](https://github.com/AyushmanGHub/APortfolio)\n\n*   **Fiedler's Theory of Spectral Graph Partitioning** (April 2025)\n    Implemented Fiedler's Theory to partition graphs while minimizing cut edges. This project utilized the spectral properties of a graph's Laplacian matrix to find optimal partitions, a key technique in network design and parallel computing.\n    *   **Paper:** [View Paper](https://drive.google.com/file/d/1JJtpv_99XfyESqNQr_QpuK5iCuthB9SW/edit)\n    *   **GitHub:** [Fiedlers-Spectral-Graph-Partitioning-Paper](https://github.com/AyushmanGHub/Fiedlers-Spectral-Graph-Partitioning-Paper)\n\n*   **CreditRisk - Predicting Borrower Reliability** (March 2025)\n    Developed and evaluated multiple binary classification models to predict loan defaults, achieving 97% accuracy. The project also identified the most significant factors contributing to credit risk through feature selection.\n    *   **GitHub:** [CreditRisk-Predicting-Borrower-Reliability](https://github.com/AyushmanGHub/CreditRisk-Predicting-Borrower-Reliability)\n\n*   **NextBuy - Predicting your next perfect purchase** (January 2025)\n    Built a comprehensive e-commerce recommendation system by combining Content-Based and Collaborative Filtering methods to provide accurate and personalized product suggestions.\n    *   **GitHub:** [NextBuy-Predicting-your-next-perfect-purchase](https://github.com/AyushmanGHub/NextBuy-Predicting-your-next-perfect-purchase)\n\n*   **ChurnPredict - Unlocking Subscription Insights** (December 2024)\n    Addressed customer churn by building and optimizing predictive models (e.g., Logistic Regression, XGBoost) with extensive feature engineering to identify at-risk subscribers.\n    *   **GitHub:** [ChurnPredict-Unlocking-Subscription-Insights](https://github.com/AyushmanGHub/ChurnPredict-Unlocking-Subscription-Insights)\n\n*   **ClusterCart - Unveiling Customer through Data** (December 2024)\n    Developed a customer segmentation system using K-Means clustering and PCA to identify distinct customer groups from transaction data, enabling targeted marketing strategies.\n    *   **GitHub:** [ClusterCart-Unveiling-Customer-through-Data](https://github.com/AyushmanGHub/ClusterCart-Unveiling-Customer-through-Data)\n\n*   **Heartbeat Sentinel - Predicting Heart Failure** (November 2024)\n    Created machine learning models (Random Forest, XGBoost) to predict heart failure risk with 90% accuracy. The project included a full pipeline from preprocessing to deployment in a Streamlit web app for real-time classification.\n    *   **App:** [Heartbeat Sentinel App](https://heartbeatsentineldecodingandpredictingheartfailure.streamlit.app/)\n    *   **GitHub:** [Heartbeat-Sentinel](https://github.com/AyushmanGHub/Heartbeat-Sentinel_Decoding-and-Predicting-Heart-Failure)\n\n*   **From Data to Dwellings: Decoding Amsterdam's Housing Prices** (October 2024)\n    Analyzed and predicted housing prices in Amsterdam using R. The project involved Exploratory Data Analysis (EDA) and visualized findings in an interactive RShiny application.\n    *   **App:** [Amsterdam House Prices App](https://gkrujk-ayur-ayushman.shinyapps.io/Decoding-Amsterdam-House-Prices-App/)\n    *   **GitHub:** [Decoding-Amsterdam-s-Housing-Prices](https://github.com/AyushmanGHub/From-Data-to-Dwellings-Decoding-Amsterdam-s-Housing-Prices)\n\n*   **Chennai Temperature and Precipitation Forecasting** (October 2024)\n    Developed a time-series forecasting model using a MultiOutputRegressor with LGBMRegressor to accurately predict average, minimum, and maximum daily temperatures in Chennai.\n    *   **GitHub:** [Daily-Temperature-Prediction-of-Chennai](https://github.com/AyushmanGHub/Daily-Temperature-Prediction-of-Chennai)\n\n*   **Availability, Accessibility and Inequality of WASH** (December 2022)\n    Mentored by Prof. Rituparna Sen at the Indian Statistical Institute, this project was a statistical analysis of inequality in Water, Sanitation, and Hygiene (WASH) services across six major Indian metro cities.\n    *   **Paper:** [View Paper](https://drive.google.com/file/d/1pfVu68jwAGkJZDnyAtd4bdaJkukxAP7l/view)\n    *   **GitHub:** [WASH_in_Metro-Cities](https://github.com/AyushmanGHub/Availability_Accessibility_and_Inequalities_of_WASH_in_Metro-Cities)\n\nWould you like to know more details about any of these projects or another aspect of Ayushman Anupam's resume?"
}